tests/load.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "ramp"
    - duration: 120
      arrivalRate: 200
      name: "steady-200"
    - duration: 60
      arrivalRate: 400
      name: "burst-400"
  defaults:
    headers:
      x-test-run: "artillery"
scenarios:
  - name: "List & View"
    flow:
      - get:
          url: "/api/products?page=1&limit=12"
      - think: 0.1
      - get:
          url: "/api/products/eco-bottle-pro"